## Pandas

In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('salaries.csv')

In [6]:
df

      Name  Salary  Age
0   Eliana  120000   34
1      Sam   90000   45
2  Antonia   80000   27
3     John   60000   25
4    Chris   85000   35
5    Vicky   75000   28

In [7]:
df['Salary']

0    120000
1     90000
2     80000
3     60000
4     85000
5     75000
Name: Salary, dtype: int64

In [9]:
df[['Salary', 'Name']]

   Salary     Name
0  120000   Eliana
1   90000      Sam
2   80000  Antonia
3   60000     John
4   85000    Chris
5   75000    Vicky

In [10]:
df['Salary'].max()

120000

In [11]:
df.describe()

         Salary        Age
count       6.0   6.000000
mean    85000.0  32.333333
std     20000.0   7.366591
min     60000.0  25.000000
25%     76250.0  27.250000
50%     82500.0  31.000000
75%     88750.0  34.750000
max    120000.0  45.000000

In [15]:
filter = df['Salary'] > 80000

In [16]:
df[filter]

     Name  Salary  Age
0  Eliana  120000   34
1     Sam   90000   45
4   Chris   85000   35

In [17]:
df[df['Salary'] > 80000]

     Name  Salary  Age
0  Eliana  120000   34
1     Sam   90000   45
4   Chris   85000   35

In [19]:
df.as_matrix()

array([['Eliana', 120000, 34],
       ['Sam', 90000, 45],
       ['Antonia', 80000, 27],
       ['John', 60000, 25],
       ['Chris', 85000, 35],
       ['Vicky', 75000, 28]], dtype=object)